#define _CRT_SECURE_NO_DEPRECATE 1
#include<stdio.h>
//数据在内存中的存储

//小例子

//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;//整形提升 补符号位
//	printf("%d %d %d", a, b, c);//-1 -1 255
//	return 0;
//}

//int main()
//{
//	char a = -128;//a=128 答案 一样
//	printf("%u\n", a);//%u打印无符号整型
//	return 0;
//}

int main()
{
	int i = -20;
	unsigned int j = 10;
	printf("%d\n", i + j);//-10
	return 0;
}

//整形在内存中的存储
//char 有符号-128->127 无符号0->255
//无符号 short 0-65535 有符号-32678->32767

//int main()
//{
//	int a = 3;
//	int b = 0x11223344;
//	//大端字节序存储方式：把一个数的低位字节序放在高地址处，高位字节序放在低地址处
//	//             11 22  33 44
//	// 	   低地址                                高地址
//	//小端字节序存储方式：把一个数的高位字节序放在低地址处，低位字节序放在高地址处
//	//             44 33 22 11
//	//     低地址                                高地址
//	return 0;
//}
//

//判断当前机器是采用大端还是小端
//int main()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}



//0 1 2 3 4 5 6 7 8 9 a  b   c   d   e   f
//                    10 11  12  13  14  15
//int main()
//{
//	/*int c = 1-1;*/
//	//cpu只有加法器
//	//1+(-1)
//	//00000000000000000000000000000001
//	//10000000000000000000000000000001
//	//原码得到相加-2
//    //补码正确00000000000000000000000000000000
//
//
//
//	/*int a = 3;
//	int b = -1;*/
//	//整数分为有符号和无符号数
//	//10000000000000000000000000000001-原码
//	//11111111111111111111111111111110-反码
//	//11111111111111111111111111111111-补码
//	//转换都是取反+1
//	//FFFFFFFF
//	 
//	//00000000000000000000000000000011-原码 有符号的整数 三个都一样
//	//00000000000000000000000000000011-补码
//	//0000 0000 0000 0000 0000 0000 0000 0011-补码
//	//0      0    0    0    0    0   0    3
//	return 0;
//}


//vs展示的是16进制的数据
//int main()
//{
//	int a = 3; //03 00 00 00   4个字节
//	int b = -1;//ff ff ff ff
//	int c = 0x11223344;//44 33 22 11
//
//	return 0;
//}



// 数据类型/
//1.内置类型
//2.构造类型（自定义）
//int main()
//{
//	char c = 'w';//char 到底是有无符号是不确定的取决于编译器的实现
//	//signed有符号的
//	signed char ch = 'w';
//	unsigned char c2 = 't';
//
//	short int a = 10;
//	short b = 20;//对于短整型来说，是有符号的，只有char是没有规定的
//
//	signed short c = 30;
//	unsigned short c = 40;
// 
//	return 0;
//}

//构造类型
//1.数组类型
//2.结构体类型struct
//3.枚举类型enum
//4.联合类型union


//void 表示空类型，在函数的返回类型，函数的参数，指针类型。


//int main()
//{
//	int i = 0;//局部变量 存放在栈
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	for (i = 0; i <= 12; i++)
//	{
//		arr[i] = 0;
//		//c,c++对数组下标不做检查
//		printf("hehe\n");
//	}
//	return 0;
//}

//栈空间的使用习惯，先使用高地址，在使用低地址
//数组随着下标的增长，地址是由低到高变化的
//但是release版本i的地址在arr下面，会造成没有死循环，13次hehe